### 쿠키와 세션을 사용하는 이유

서버와 클라이언트가 통신을 할 때마다 서버는 클라이언트가 누구인지 인증을 계속해야 한다.
그 이유는 HTTP 프로토콜이 비연결성,무상태 특징을 가지고 있기 때문이다.
`비연결성`:클라이언트가 요청을 한 후 응답을 받으면 그 연결을 끊어버리는 특징
`무상태`:통신이 끝나면 상태를 유지하지 않는 특징

쿠키와 세션은 위의 HTTP특징에 대한 단점을 해결하기 위해 즉 `클라이언트 인증을 유지하기위해` 사용한다.
예를 들어, 쿠키와 세션을 사용하지 않으면 쇼핑몰에서 옷을 구매하려고 최초로그인을 했음에도 페이지를 이동할 때마다 로그인을 계속해야한다.
서버는 클라이언트가 누구인지 기억을 못하기 때문이다.

쿠키와 세션을 사용하면 최초로그인을 하면 어떤 방식에 의해 서버가 그 사용자에 대한 인증을 유지하게 된다.
즉, 쿠키와 세션을 통해 서버는 클라이언트를 기억하고 있는 것이다.

### 쿠키 Cookie

쿠키란, 클라이언트 측(브라우저)에서 관리되는 작은 기록 정보 파일을 의미한다.
쿠키에는 사용자 인증이 유효한 시간을 명시할 수 있고 한번 유효시간이 정해지면 브라우저를 끄더라도 인증이 유지된다는 특징이 있다.

#### 쿠키 사용예시
- 방문 사이트에 로그인 시 (아이디,비번 저장)
- 쇼핑몰 장바구니 기능

### 세션 Session

세션은 쿠키를 기반으로 하고 있지만 사용자 정보 파일을 브라우저에서 저장하는 쿠키와 달리 세션은 서버측에서 관리한다.
사용자에 대한 정보를 서버에 저장하기에 쿠키보다 보안에 좋지만, 사용자가 많아질수록 서버 메모리를 많이 차지하게 된다.
즉, 접속자가 많은 웹사이트의 경우 서버에 과부하를 주게 되므로 성능 저하의 요인이 된다.


#### 쿠키, 세션 차이

쿠키와 세션은 비슷한 역할을 한다. 가장 큰 차이점은 사용자의 기록정보가 저장되는 위치다.
때문에 쿠키는 서버의 자원을 전혀 사용하지 않고 세션은 서버의 자원을 사용한다.
보안면에서 세션이 더 우수하며 요청 속도는 쿠키가 세션보다 더 빠른데, 세션의 경우 서버에서의 처리가 필요하기 때문이다.
